In [47]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.filterwarnings("ignore")

In [55]:
data = pd.read_csv("raw_data.csv")

In [56]:
display(data.shape)
data.head()

(16469, 410)

,Q1,Q2A1,Q2A2,Q2A3,Q2A4,Q2A5,Q2_1,Q3A1,Q3A2,Q3A3,...,D_COU,D_GEN,D_AGE,D_Q5_1,D_Q13,D_Q1,DD_Q1,WT,COUNTRY,CITY
0,1,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,NaN,...,13.0,1.0,3.0,1.0,1.0,1.0,1.0,0.26,12,1513
1,1,2.0,NaN,NaN,NaN,NaN,4.0,1.0,NaN,NaN,...,2.0,1.0,5.0,1.0,1.0,1.0,1.0,1.50,2,204
2,6,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,NaN,...,2.0,2.0,2.0,1.0,1.0,4.0,2.0,1.81,2,211
3,2,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,NaN,...,2.0,2.0,2.0,1.0,1.0,2.0,2.0,1.61,2,253
4,3,3.0,NaN,NaN,NaN,NaN,2.0,1.0,NaN,NaN,...,2.0,2.0,3.0,1.0,1.0,3.0,2.0,1.87,2,201

In [57]:
data['Q5_1'].value_counts()

1    12269
2     3622
3      484
4       59
5       35
Name: Q5_1, dtype: int64

In [58]:
data['Q6_1A1'].value_counts()

1     5471
6     3940
2     2594
11    1105
4      955
3      936
5      709
7      326
9      212
8      179
10      42
Name: Q6_1A1, dtype: int64

In [59]:
data['Q5_2A1'].value_counts()

1.0     3281
2.0     2493
4.0     1866
3.0     1397
5.0      649
14.0     514
9.0      484
17.0     316
8.0      226
12.0     174
13.0     159
7.0      158
6.0      142
10.0     137
15.0     104
16.0      91
11.0      78
Name: Q5_2A1, dtype: int64

In [60]:
data['Q13'].value_counts()

1    13437
3     2169
2      863
Name: Q13, dtype: int64

In [61]:
data['newID'] = data['D_MON'].astype('int').astype('str') + '-' + data['ID'].astype('str')

In [62]:
con = ['newID', 'Q5_1', 'Q6_1A1', 'Q5_2A1', 'Q13']

In [63]:
df = data[con]

In [64]:
df.shape

(16469, 5)

In [65]:
df.head()

  newID  Q5_1  Q6_1A1  Q5_2A1  Q13
0   1-1     1       5     1.0    1
1   2-1     1       6     3.0    1
2   3-1     1       2     8.0    1
3   4-1     1      11     2.0    1
4   5-1     1       6     1.0    1

In [72]:
df = df.fillna(0)

In [73]:
df.isnull().sum()

newID     0
Q5_1      0
Q6_1A1    0
Q5_2A1    0
Q13       0
dtype: int64

In [74]:
df.to_csv("data_dj.csv", index=False)

In [69]:
data1 = pd.read_csv("data_dj.csv")

In [70]:
data1.head()

  newID  Q5_1  Q6_1A1  Q5_2A1  Q13
0   1-1     1       5     1.0    1
1   2-1     1       6     3.0    1
2   3-1     1       2     8.0    1
3   4-1     1      11     2.0    1
4   5-1     1       6     1.0    1

In [41]:
tour = pd.read_csv("tour_region.csv", engine = 'python')

In [42]:
tour.head()

   시도   군구       총계
0  서울  종로구  4447571
1  서울  종로구   477628
2  서울  종로구   767446
3  서울  종로구  1664692
4  서울   중구  1716334

In [44]:
tour1 = tour.groupby('시도')['총계'].agg([('입장객수','sum')]).reset_index()

In [46]:
tour1.head()

   시도      입장객수
0  강원  39953794
1  경기  73841650
2  경남  37015480
3  경북  50240819
4  광주   6374861

In [75]:
tour1.to_csv("tour_region_real.csv", index=False)

In [77]:
real = pd.read_csv("tour_region_real.csv")

In [78]:
real.head()

   시도      입장객수
0  강원  39953794
1  경기  73841650
2  경남  37015480
3  경북  50240819
4  광주   6374861

In [80]:
var = pd.read_csv("region_var.csv", engine = 'python')

In [82]:
var.shape

(17, 6)

In [98]:
region.isnull().sum()

시도         0
공항수        0
면세점개수      0
버스터미널개수    0
병원수        0
주요쇼핑지점수    0
입장객수       0
dtype: int64

In [87]:
var.head()

   시도  공항수  면세점개수  버스터미널개수  병원수  주요쇼핑지점수
0  서울    1     15        5  418       28
1  부산    1      6        2  377       10
2  대구    1      2        7  191        7
3  인천    1     19        4  158        2
4  광주    1      0        1  169        4

In [91]:
real.head()

   시도      입장객수
0  강원  39953794
1  경기  73841650
2  경남  37015480
3  경북  50240819
4  광주   6374861

In [92]:
region = pd.merge(var, real, on='시도')

In [93]:
region.head()

   시도  공항수  면세점개수  버스터미널개수  병원수  주요쇼핑지점수      입장객수
0  서울    1     15        5  418       28  25483265
1  부산    1      6        2  377       10   8628120
2  대구    1      2        7  191        7  13090632
3  인천    1     19        4  158        2   7608659
4  광주    1      0        1  169        4   6374861

In [94]:
region.tail()

    시도  공항수  면세점개수  버스터미널개수  병원수  주요쇼핑지점수      입장객수
12  전남    2      1       51  190        1  50736268
13  경북    1      0       54  222        1  50240819
14  경남    1      1       38  310        6  37015480
15  제주    1      8        2   23        0  14814068
16  세종    0      0        1    8        1    590609

In [95]:
var

    시도  공항수  면세점개수  버스터미널개수  병원수  주요쇼핑지점수
0   서울    1     15        5  418       28
1   부산    1      6        2  377       10
2   대구    1      2        7  191        7
3   인천    1     19        4  158        2
4   광주    1      0        1  169        4
5   대전    0      0        6  112        2
6   울산    1      1        4   95        3
7   경기    0      2       45  677       25
8   강원    2      1       52   97        0
9   충북    1      3       33  105        4
10  충남    0      0       43  154        2
11  전북    1      1       46  188        2
12  전남    2      1       51  190        1
13  경북    1      0       54  222        1
14  경남    1      1       38  310        6
15  제주    1      8        2   23        0
16  세종    0      0        1    8        1

In [89]:
real

    시도      입장객수
0   강원  39953794
1   경기  73841650
2   경남  37015480
3   경북  50240819
4   광주   6374861
5   대구  13090632
6   대전   7082357
7   부산   8628120
8   서울  25483265
9   세종    590609
10  울산   5208965
11  인천   7608659
12  전남  50736268
13  전북  38093016
14  제주  14814068
15  충남  26828348
16  충북  25452411

In [100]:
region.to_csv("region_dj.csv", index=False)

In [101]:
region.head()

   시도  공항수  면세점개수  버스터미널개수  병원수  주요쇼핑지점수      입장객수
0  서울    1     15        5  418       28  25483265
1  부산    1      6        2  377       10   8628120
2  대구    1      2        7  191        7  13090632
3  인천    1     19        4  158        2   7608659
4  광주    1      0        1  169        4   6374861

In [105]:
sg = pd.read_csv("sido.csv", engine = 'python')

In [106]:
sg.head()

  SIDO_NM SGNG_NM
0     강원도     춘천시
1     강원도     춘천시
2     강원도     춘천시
3     강원도     춘천시
4     강원도     춘천시

In [107]:
unique_sd = sg.drop_duplicates()

In [108]:
unique_sd.head()

     SIDO_NM SGNG_NM
0        강원도     춘천시
365      강원도     원주시
794      강원도     강릉시
1119     강원도     동해시
1247     강원도     태백시

In [109]:
unique_sd.to_csv("uni_sd.csv", index=False)

In [116]:
uni = pd.read_csv("uni_sd.csv")

In [117]:
uni.head()

  SIDO_NM SGNG_NM
0     강원도     춘천시
1     강원도     원주시
2     강원도     강릉시
3     강원도     동해시
4     강원도     태백시

In [136]:
df = pd.read_csv("tour_region_0722.csv", encoding = 'cp949')

In [137]:
df.head()

  SIDO_NM SGNG_NM      입장객수
0   서울특별시   서울특별시  25483265
1   부산광역시   부산광역시   8628120
2   대구광역시   대구광역시  13090632
3   인천광역시   인천광역시   7608659
4   광주광역시   광주광역시   6374861

In [138]:
tour2 = df.groupby(['SIDO_NM', 'SGNG_NM'])['입장객수'].agg([('입장객수','sum')]).reset_index()

In [139]:
tour2.head()

  SIDO_NM SGNG_NM     입장객수
0     강원도     강릉시  2790413
1     강원도     고성군  1372363
2     강원도     동해시   857739
3     강원도     삼척시  1459346
4     강원도     속초시  5136207

In [140]:
tour2.to_csv("real_tour_number_1.csv", index=False)

In [141]:
sido = pd.read_csv("sido_unique.csv", encoding = 'cp949')

In [142]:
m1 = pd.merge(sido, tour2, on=['SIDO_NM', 'SGNG_NM'], how='left')

In [143]:
m1.head()

  SIDO_NM SGNG_NM       입장객수
0     강원도     춘천시  7838908.0
1     강원도     원주시  2487501.0
2     강원도     강릉시  2790413.0
3     강원도     동해시   857739.0
4     강원도     태백시  1267122.0

In [145]:
airport = pd.read_csv("airport.csv", encoding = 'cp949')

In [146]:
airport.head()

  SIDO_NM SGNG_NM  공항수
0   서울특별시   서울특별시    1
1   부산광역시   부산광역시    1
2   대구광역시   대구광역시    1
3   인천광역시   인천광역시    1
4   광주광역시   광주광역시    1

In [147]:
m2 = pd.merge(m1, airport, on=['SIDO_NM', 'SGNG_NM'], how='left')

In [149]:
m2.head()

  SIDO_NM SGNG_NM       입장객수  공항수
0     강원도     춘천시  7838908.0  NaN
1     강원도     원주시  2487501.0  NaN
2     강원도     강릉시  2790413.0  NaN
3     강원도     동해시   857739.0  NaN
4     강원도     태백시  1267122.0  NaN

In [150]:
tax = pd.read_csv("taxfree.csv", encoding = 'cp949')

In [151]:
tax.head()

  SIDO_NM SGNG_NM  면세점개수
0   서울특별시   서울특별시     15
1   부산광역시   부산광역시      6
2   대구광역시   대구광역시      2
3   인천광역시   인천광역시     19
4   울산광역시   울산광역시      1

In [152]:
m3 = pd.merge(m2, tax, on=['SIDO_NM', 'SGNG_NM'], how='left')

In [153]:
m3.head()

  SIDO_NM SGNG_NM       입장객수  공항수  면세점개수
0     강원도     춘천시  7838908.0  NaN    NaN
1     강원도     원주시  2487501.0  NaN    NaN
2     강원도     강릉시  2790413.0  NaN    NaN
3     강원도     동해시   857739.0  NaN    NaN
4     강원도     태백시  1267122.0  NaN    NaN

In [154]:
shop = pd.read_csv("shop.csv", encoding = 'cp949')

In [155]:
shop.head()

  SIDO_NM SGNG_NM  쇼핑장소개수
0   서울특별시   서울특별시      30
1   부산광역시   부산광역시      10
2   대구광역시   대구광역시       7
3   인천광역시   인천광역시       2
4   광주광역시   광주광역시       4

In [156]:
m4 = pd.merge(m3, shop, on=['SIDO_NM', 'SGNG_NM'], how='left')

In [157]:
m4.shape

(161, 6)

In [163]:
tot_region = m4.fillna(0)

In [164]:
tot_region.head()

  SIDO_NM SGNG_NM       입장객수  공항수  면세점개수  쇼핑장소개수
0     강원도     춘천시  7838908.0  0.0    0.0     0.0
1     강원도     원주시  2487501.0  0.0    0.0     1.0
2     강원도     강릉시  2790413.0  0.0    0.0     0.0
3     강원도     동해시   857739.0  0.0    0.0     0.0
4     강원도     태백시  1267122.0  0.0    0.0     0.0

In [165]:
tot_region.isnull().sum()

SIDO_NM    0
SGNG_NM    0
입장객수       0
공항수        0
면세점개수      0
쇼핑장소개수     0
dtype: int64

In [166]:
! pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\h\anaconda3\lib\site-packages (2.5.6)
Requirement already satisfied: et-xmlfile in c:\users\h\anaconda3\lib\site-packages (from openpyxl) (1.0.1)
Requirement already satisfied: jdcal in c:\users\h\anaconda3\lib\site-packages (from openpyxl) (1.4)

In [168]:
from openpyxl import Workbook

In [ ]:
writer = pd.ExcelWriter('tot_region.xlsx', engine='xlsxwriter')

In [172]:
tot_region.to_excel(writer, sheet_name='Sheet1')

In [173]:
writer.close()